***
# SQL Homework - Employee Database: A Myster in Two Parts
***

# Bonus-Anaylsis
***
### Import SQL database into Pandas

In [12]:
# Importing neccessary Dependency's:
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy 
import psycopg2
from sqlalchemy import create_engine
from config import password
from config import username

In [3]:
# Connecting to localhost database:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employee_db')
connection = engine.connect()

In [4]:
# Review the tables from SQL Database
engine.table_names()

['departments', 'titles', 'employees', 'dept_emp', 'dept_manager', 'salaries']

##  Create a histogram to visualize the most common salary ranges for employees.
***
####  1.  Importing all Database tables from SQL for analysis:

In [5]:
# Query all records in the database from SQL:
# Table 1:
# Reading in from SQL the employees database:
employees_df = pd.read_sql("SELECT * FROM employees", connection, parse_dates=['birth_date', 'hire_date'])
employees_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [6]:
# Table 2:
# Reading in from SQL the Departments database:
departments_df = pd.read_sql("SELECT * FROM departments", connection)
departments_df

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [7]:
# Table 3:
# Reading in from SQL the Salaries database:
salaries_df = pd.read_sql("SELECT * FROM salaries", connection)
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [8]:
# Table 4:
# Reading in from SQL Dept_manager database:
dept_manager_df = pd.read_sql("SELECT * FROM dept_manager", connection)
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [9]:
# Table 5:
# Reading in from SQL the Titles database:
titles_df = pd.read_sql("SELECT * FROM titles", connection)
titles_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [10]:
# Table 6:
# Reading in from SQL the Titles database:
dept_emp_df = pd.read_sql("SELECT * FROM dept_emp", connection)
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

> 2. #### Joining tables to collate columns and create a histogram to visualize the most common salary ranges for employees:
    1. Joining using SQL
    2. Joining using Pandas

In [11]:
# Creating SQL query to join columns necessary:
employee_salary = """ 
    SELECT e.emp_no AS "Employee Number",
           t.title AS "Employee Titles",
           s.salary AS "Employee Salary"
    FROM employees AS e
    LEFT JOIN salaries AS s
    ON e.emp_no = s.emp_no
    LEFT JOIN titles AS t
    ON t.title_id = e.emp_title_id;
    """

salary_df = pd.read_sql(employee_salary,connection)
salary_df.head()

   Employee Number  Employee Titles  Employee Salary
0            10005            Staff            78228
1            10010         Engineer            72488
2            10011            Staff            42365
3            10018  Senior Engineer            55881
4            10035  Senior Engineer            41538